ATsupportum/src/InformationRegisters/ПрисоединенныеФайлы/ПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрисоединенныеФайлы</name>
  <resources>
    <name>ХранимыйФайл</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>CatalogRef.ОрганизацииПрисоединенныеФайлы</types>
      <types>CatalogRef.ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы</types>
      <types>CatalogRef.ЭлектронноеПисьмоВходящееПрисоединенныеФайлы</types>
      <types>CatalogRef.Договоры_атПрисоединенныеФайлы</types>
      <types>CatalogRef.Заявка_атПрисоединенныеФайлы</types>
      <types>CatalogRef.ЗапланированноеВзаимодействиеПрисоединенныеФайлы</types>
      <types>CatalogRef.ЭкземплярыПродуктов_атПрисоединенныеФайлы</types>
      <types>CatalogRef.Реализация_атПрисоединенныеФайлы</types>
      <types>CatalogRef.СообщениеSMSПрисоединенныеФайлы</types>
      <types>CatalogRef.ПоставкиПродуктов_атПрисоединенныеФайлы</types>
      <types>CatalogRef.Задание_атПрисоединенныеФайлы</types>
      <types>CatalogRef.Контрагенты_атПрисоединенныеФайлы</types>
      <types>CatalogRef.ВстречаПрисоединенныеФайлы</types>
      <types>CatalogRef.ТелефонныйЗвонокПрисоединенныеФайлы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ATsupportum/src/InformationRegisters/УказательНаФайлы_ат/УказательНаФайлы_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УказательНаФайлы_ат</name>
  <resources>
    <name>Путь</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипХранения</name>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </resources>
  <attributes>
    <name>Том</name>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <dimensions>
    <name>ХешСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ATsupportum/src/Catalogs/ХранимыеФайлы_ат/ХранимыеФайлы_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранимыеФайлы_ат</name>
  <attributes>
    <name>ХранимыйФайл</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ATsupportum/src/InformationRegisters/ПрисоединенныеФайлы/RecordSetModule.bsl
//@comm +++

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если Отказ Или Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//Отказ = Истина;
	
	Для Каждого Запись Из ЭтотОбъект Цикл 
		
		ДвоичныеДанные = Запись.ХранимыйФайл.Получить();
		ХешКод = РаботаСХешСуммойДляФайлов_ат.ПолучитьХешКодДвоичныхДанных(ДвоичныеДанные);
		РазмерДанных = ДвоичныеДанные.Размер();
		
		Если РаботаСХешСуммойДляФайлов_ат.ХешФайлаУникален(ХешКод, РазмерДанных) Тогда
			Сообщить("Новый файл (hash = " + ХешКод + "), загружаем.");
			Попытка
				НовыйХранимыйФайл = Справочники.ХранимыеФайлы_ат.СоздатьЭлемент();
				НовыйХранимыйФайл.Код = ХешКод;
				НовыйХранимыйФайл.ХранимыйФайл = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
				НовыйХранимыйФайл.Размер = РазмерДанных;
				НовыйХранимыйФайл.Записать();
				
				НаборЗаписей = РегистрыСведений.УказательНаФайлы_ат.СоздатьНаборЗаписей();
				//НаборЗаписей.Прочитать();
				
				Запись = НаборЗаписей.Добавить();
				Запись.ХешСумма = ХешКод;
				Запись.Путь = "";
				Запись.Том = Справочники.ТомаХраненияФайлов.ПустаяСсылка();
				Запись.ТипХранения = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе;
				Запись.РазмерФайла = РазмерДанных;
				
				НаборЗаписей.Записать(Ложь);
			Исключение
				Сообщить("Не удалось записать новый элемент справочника 'ХранимыеФайлы'!");
			КонецПопытки;
		Иначе
			// тут ничего не делаем, файл уже существует, когда он нам понадобится - найдем его по хешкоду и размеру
			Сообщить("Файл уже существует (hash = " + ХешКод + "), будет использована имеющаяся копия.");
		КонецЕсли;
		
	КонецЦикла;
	
	// В регистр не пишем!
	ЭтотОбъект.Очистить();
	
КонецПроцедуры

//@comm ---
